2022-04-28-221119-nixos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-27 Sat 01:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NixOs</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">NixOs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdb4fbe5">1. NixOS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="nixos">nixos</span></span></a>
<ul>
<li><a href="#org40e07d9">1.1. Tips</a>
<ul>
<li><a href="#org391a02a">1.1.1. Development in nixos</a></li>
<li><a href="#orge6e5515">1.1.2. Installation</a></li>
<li><a href="#org9216e14">1.1.3. Nix on non nixos system</a></li>
<li><a href="#orgddcb9ac">1.1.4. Nixos Channels</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><a href="index.html#ID-c72d4e02-0e32-424c-b4b3-c471adbf4598">Index</a></li>
</ul>
<div id="outline-container-orgdb4fbe5" class="outline-2">
<h2 id="orgdb4fbe5"><span class="section-number-2">1.</span> NixOS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="nixos">nixos</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
From NixOS Wiki
</p>


<p>
<a href="https://nixos.org/">NixOS</a> is a Linux distribution based on the <a href="https://nixos.wiki/wiki/Nix">Nix</a> package manager and build system. It supports <a href="https://reproducible-builds.org/">reproducible</a> and <a href="https://en.wikipedia.org/wiki/Declarative_programming">declarative</a> system-wide <a href="https://en.wikipedia.org/wiki/Configuration_management">configuration management</a> as well as <a href="https://en.wikipedia.org/wiki/Atomicity_(database_systems)">atomic</a> upgrades and rollbacks, although it can additionally support <a href="https://en.wikipedia.org/wiki/Imperative_programming">imperative</a> package and user management. In NixOS, all components of the distribution — including the <a href="https://en.wikipedia.org/wiki/Linux_kernel">kernel</a>, installed <a href="https://en.wikipedia.org/wiki/Package_manager">packages</a> and system configuration files — are built by <a href="https://nixos.wiki/wiki/Nix">Nix</a> from <a href="https://en.wikipedia.org/wiki/Pure_function">pure functions</a> called <a href="https://nixos.wiki/wiki/Nix_Expression_Language">Nix expressions</a>.
</p>

<p>
Since Nix uses <a href="https://en.wikipedia.org/wiki/Executable">binary</a> caching, this provides a unique compromise between the binary-oriented approach used by distributions such as Debian and the <a href="https://en.wikipedia.org/wiki/Source_code">source</a>&#x00ad;oriented approach used by distributions such as Gentoo. Binaries can be used for standard components, and custom-built packages and modules can be used automatically when a pre-built binary is not available.
</p>

<p>
Stable NixOS releases are delivered twice a year. NixOS was created by <a href="https://edolstra.github.io/">Eelco Dolstra</a> and <a href="https://en.wikipedia.org/wiki/Armijn_Hemel">Armijn Hemel</a>, and initially released in 2003. It is community developed and maintained under the stewardship of the <a href="https://nixos.org/nixos/foundation.html">NixOS Foundation</a>.
</p>
</div>
<div id="outline-container-org40e07d9" class="outline-3">
<h3 id="org40e07d9"><span class="section-number-3">1.1.</span> Tips</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Have a config, but its broken? Check your git log and revert if needed.</li>
</ul>
</div>
<div id="outline-container-org391a02a" class="outline-4">
<h4 id="org391a02a"><span class="section-number-4">1.1.1.</span> Development in nixos</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org4b10787"></a>Python<br />
<div class="outline-text-5" id="text-1-1-1-1">
<ul class="org-ul">
<li><a href="programming/20220429153134-nixos_python.html#ID-018850fc-57de-4163-870f-cbd906e8516f">nixos-python</a></li>
</ul>
</div>
</li>
<li><a id="org1c48e87"></a>Nim<br />
<div class="outline-text-5" id="text-1-1-1-2">
<ul class="org-ul">
<li><a href="nixos-nim.html#ID-6dbd98c1-06ee-490f-a94b-308da099a6f2">Nixos Nim</a></li>
<li><a href="Tutorial/2022-05-17-053529-how_to_package_nim.html#ID-69dc4e90-c532-4f12-807f-89f77036e8d1">how to package nim</a></li>
</ul>
</div>
</li>
<li><a id="orga006337"></a>packaging<br />
<div class="outline-text-5" id="text-1-1-1-3">
<ul class="org-ul">
<li><a href="Tutorial/2022-05-17-051936-nixos_custom_pkgs.html#ID-3866dd8f-fc14-491a-af3a-bbd0c4c5ce98">nixos custom pkgs</a></li>
<li><a href="https://ryantm.github.io/nixpkgs/">https://ryantm.github.io/nixpkgs/</a></li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orge6e5515" class="outline-4">
<h4 id="orge6e5515"><span class="section-number-4">1.1.2.</span> Installation</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="org457234d"></a>Raspberry pi<br />
<div class="outline-text-5" id="text-1-1-2-1">
<ul class="org-ul">
<li><a href="Tutorial/2022-06-01-033435-cross_compile_nixos_to_sdcard_for_rpi3b.html#ID-d7085ecb-5bc7-48cf-b039-4ff204352534">cross compile nixos to sdcard for rpi3b+</a></li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org9216e14" class="outline-4">
<h4 id="org9216e14"><span class="section-number-4">1.1.3.</span> Nix on non nixos system</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li><a href="Tutorial/2022-08-22-022748-non_nixos_desktop_intergration.html#ID-20916295-adc2-4f83-a5dd-c42482478ca0">non nixos desktop intergration</a><a href="Tutorial/2022-08-22-022748-non_nixos_desktop_intergration.html#ID-20916295-adc2-4f83-a5dd-c42482478ca0">non nixos desktop intergration</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgddcb9ac" class="outline-4">
<h4 id="orgddcb9ac"><span class="section-number-4">1.1.4.</span> Nixos Channels</h4>
<div class="outline-text-4" id="text-1-1-4">
<ul class="org-ul">
<li><a href="20221220021836-nixpkgs_fork_service.html#ID-606957f7-f85c-442a-9a16-abd5b3e00151">NixPkgs enable a service from different channel?</a></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-05-27 Sat 01:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
